# 変数 age に数値（例えば 20）を代入して、
# もし 20 歳以上なら「成人です」と表示しよう！
# 20歳未満なら「未成年です」と表示しよう！
age = 20
if age >= 20:
    print("成人です")
else:
    print("未成年です")

# 変数 age に好きな数を代入して、
# 以下のように条件分岐してメッセージを表示してみよう！

# 20歳以上 → 「成人です」
# 13歳以上かつ20歳未満 → 「未成年（ティーン）です」
# 13歳未満 → 「子どもです」
age = 19

if age >= 20:
    print("成人です")
elif age >= 13:
    print("未成年（ティーン）です")
else:
    print("子どもです")

# score に数値を入れて、
# 以下のルールで判定するプログラムを書いてみよう！

# 90点以上かつ100点以下 → 「とてもよくできました！」
# 70点以上90点未満       → 「よくできました」
# 70点未満               → 「もう少しがんばろう」

score = 89

if 90 <= score and score <= 100:
    print("とてもよくできました！")
elif 70 <= score and score < 90:
    print("よくできました")
else:
    print("もう少しがんばろう")
